app/controllers/course_contents_controller.rb

SELECT `course_contents`.* FROM `course_contents`
---
	def index
        courses = CourseContent.all