app/controllers/users_controller.rb

    def show
        render json: User.find(params[:id])
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = NULL LIMIT 1

    def login
        user = User.find_by(email: params[:email])
---
SELECT `users`.* FROM `users` WHERE `users`.`email` = 'user1@user.com' LIMIT 1

    def get_content_with_quesans
        course = CourseContent.includes(:questions).find_by(topic_name: params[:topic])
---
SELECT `course_contents`.* FROM `course_contents` WHERE `course_contents`.`topic_name` = 'yoga' LIMIT 1

    def create_user
        user = User.create(user_params)
---
INSERT INTO `users` (`email`, `password_digest`, `created_at`, `updated_at`) VALUES ('user5@user.com', '$2a$12$X48k.UYjcG5BxR1F2y12O.wxIdQ0NGBkluDZUBMs.iv8ZCbaVu5o2', '2021-07-09 02:10:45.639920', '2021-07-09 02:10:45.639920')